# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Uma introdução à Linguagem Prolog
#+Author: Prof. Lucas M. Schnorr (UFRGS)
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{../org-babel.tex}

* Olá Mundo em Lógica
Em um terminal, executar o \texttt{swipl}
#+begin_src PROLOG
write('Ola Mundo').
#+end_src

#+latex:\vfill

Ou:

Coloque o conteúdo acima em =codigo.pl= e depois

#+begin_src shell :results output
cat codigo.pl | swipl
#+end_src

#+RESULTS:
: Ola Mundo
: true.
: 
: 

